STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_RC_LongRange_Central/STM32_BLE/App/app_ble.c
      /* USER CODE BEGIN PROC_GAP_CENTRAL_SCAN_START */
      phy = LE_1M_PHY_BIT;
      /* USER CODE END PROC_GAP_CENTRAL_SCAN_START */
      break;
    }/* PROC_GAP_CENTRAL_SCAN_START */
    case PROC_GAP_CENTRAL_SCAN_TERMINATE:
    {
      paramA = 1;
      paramB = 1;
      paramC = APP_BLE_IDLE;

      /* USER CODE BEGIN PROC_GAP_CENTRAL_SCAN_TERMINATE */

      /* USER CODE END PROC_GAP_CENTRAL_SCAN_TERMINATE */
      break;
    }/* PROC_GAP_CENTRAL_SCAN_TERMINATE */
    /* USER CODE BEGIN GAP_CENTRAL_1 */
    case PROC_GAP_CENTRAL_SCAN_START_CODED_PHY:
    {
      paramA = SCAN_INT_MS(500);
      paramB = SCAN_WIN_MS(500);
      paramC = APP_BLE_SCANNING;
      break;
    }/* PROC_GAP_CENTRAL_SCAN_START_CODED_PHY */
    case PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS_1M_PHY:
    {
      phy = LE_1M_PHY_BIT;
      break;
    }/* PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS_1M_PHY */
    case PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS_CODED_PHY:
    {
      phy = LE_CODED_PHY_BIT;
      break;
    }/* PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS_CODED_PHY */
    case PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS:
    {
      paramA = SCAN_INT_MS(500);
      paramB = SCAN_WIN_MS(500);
      paramC = APP_BLE_LP_CONNECTING;
      break;
    }/* PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS */
    /* USER CODE END GAP_CENTRAL_1 */
    default:
      break;
  }

  /* Call ACI APIs */
  switch(ProcGapCentralId)
  {
    case PROC_GAP_CENTRAL_SCAN_START:
    {
      status = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, 0x00, LE_1M_PHY_BIT, HCI_SCAN_TYPE_ACTIVE, paramA, paramB);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gap_set_scan_configuration - fail, result: 0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> aci_gap_set_scan_configuration - Success\n");
      }

      status = aci_gap_start_procedure (GAP_GENERAL_DISCOVERY_PROC,LE_1M_PHY_BIT,0,0);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gap_start_procedure - fail, result: 0x%02X\n", status);
      }
      else
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        APP_DBG_MSG("==>> aci_gap_start_procedure - Success\n");
      }
      break;
    }/* PROC_GAP_CENTRAL_SCAN_START */
    case PROC_GAP_CENTRAL_SCAN_TERMINATE:
    {
      status = aci_gap_terminate_proc(GAP_GENERAL_DISCOVERY_PROC);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gap_terminate_gap_proc - fail, result: 0x%02X\n",status);
      }
      else
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        APP_DBG_MSG("==>> aci_gap_terminate_gap_proc - Success\n");
      }
      break;
    }/* PROC_GAP_CENTRAL_SCAN_TERMINATE */
    /* USER CODE BEGIN GAP_CENTRAL_2 */


    case PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS_1M_PHY: 
      {
        phy = LE_1M_PHY_BIT;
        UTIL_SEQ_SetTask( 1U << CFG_TASK_CONNECT_REQUEST_FIXED_ADDRESS, CFG_SEQ_PRIO_0);
        break;
      } /* PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS_1M_PHY */
    case PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS_CODED_PHY: 
      {
        phy = LE_CODED_PHY_BIT;
        UTIL_SEQ_SetTask( 1U << CFG_TASK_CONNECT_REQUEST_FIXED_ADDRESS, CFG_SEQ_PRIO_0);
        break;
      } /* PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS_CODED_PHY */
    case PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS: 
      {
        /* Start the timer to manage the blinking of LED2 during the scanning process. */
        HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Scanning_Switch_On_Off_Led_timer_Id, SCAN_SWITCH_ON_OFF_LED2_TIMEOUT_MS);
        
        paramA = SCAN_INT_MS(500);
        paramB = SCAN_WIN_MS(500);
        paramC = APP_BLE_SCANNING;
        
        if(phy == LE_1M_PHY_BIT)
        {
          APP_DBG_MSG("==>> PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS for  LE_1M_PHY_BIT\n");
        }
        else
        {
          APP_DBG_MSG("==>> PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS for  LE_CODED_PHY_BIT\n");
        }
        
        status = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, 
                                                0x00, 
                                                phy, 
                                                HCI_SCAN_TYPE_PASSIVE, //HCI_SCAN_TYPE_ACTIVE, 
                                                paramA, 
                                                paramB);
        if(status != BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("aci_gap_set_scan_configuration - fail, result: 0x%02X\n", status);
        }
        else
        {
          APP_DBG_MSG("==>> aci_gap_set_scan_configuration - Success\n");
        }
                
        status = aci_gap_set_connection_configuration(phy,
                                                      CONN_INT_MS(50u), 
                                                      CONN_INT_MS(100u),
                                                      0u,
                                                      CONN_SUP_TIMEOUT_MS(5000u),
                                                      CONN_CE_LENGTH_MS(10u),
                                                      CONN_CE_LENGTH_MS(10u));
        if(status == BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("==>> aci_gap_set_connection_configuration Success , status: 0x%02X\n", status);
        }
        else
        {
          APP_DBG_MSG("==>> aci_gap_set_connection_configuration Failed , status: 0x%02X\n", status);
        }  

        uint8_t peripheral_bd_address[6] = {0};

        peripheral_bd_address[0] = (uint8_t)((PERIPHERAL_PUBLIC_BD_ADDRESS & 0x0000000000FF));
        peripheral_bd_address[1] = (uint8_t)((PERIPHERAL_PUBLIC_BD_ADDRESS & 0x00000000FF00) >> 8);
        peripheral_bd_address[2] = (uint8_t)((PERIPHERAL_PUBLIC_BD_ADDRESS & 0x000000FF0000) >> 16);
        peripheral_bd_address[3] = (uint8_t)((PERIPHERAL_PUBLIC_BD_ADDRESS & 0x0000FF000000) >> 24);
        peripheral_bd_address[4] = (uint8_t)((PERIPHERAL_PUBLIC_BD_ADDRESS & 0x00FF00000000) >> 32);
        peripheral_bd_address[5] = (uint8_t)((PERIPHERAL_PUBLIC_BD_ADDRESS & 0xFF0000000000) >> 40);
          
