STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_RC_LongRange_Central/STM32_BLE/App/app_ble.c
        /*
         * A direct connection with a peer device can be built by the aci_gap_create_connection(). This API specifies
         * the PHY only to be used for the connection, the peer device type (Peer_Address_Type parameter) and the
         * peer address (Peer_Address parameter).
         */
        APP_DBG_MSG("==>> (FIXED ADDRESS) aci_gap_create_connection to ");
        APP_DBG_MSG("Peripheral Public Bluetooth Address: %02X:%02X:%02X:%02X:%02X:%02X\n",peripheral_bd_address[5],peripheral_bd_address[4],peripheral_bd_address[3],peripheral_bd_address[2],peripheral_bd_address[1],peripheral_bd_address[0]);
        status = aci_gap_create_connection(phy, HCI_ADDR_PUBLIC, peripheral_bd_address);
        if (status == BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("==>> (FIXED ADDRESS) aci_gap_create_connection GAP Create connection Success\n");
          bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
          APP_DBG_MSG("     (FIXED ADDRESS)  wait for event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
          UTIL_SEQ_WaitEvt(1u << CFG_IDLEEVT_CONNECTION_COMPLETE);
          APP_DBG_MSG("     (FIXED ADDRESS)  received event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
        }
        else
        {
          APP_DBG_MSG("==>> (FIXED ADDRESS) aci_gap_create_connection GAP Create connection Failed , status: 0x%02X\n", status);
          bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
          
          APP_DBG_MSG("==>> GAP Create connection will re-start due to failed connection.\n");
          UTIL_SEQ_SetTask( 1U << CFG_TASK_CONNECT_REQUEST_FIXED_ADDRESS, CFG_SEQ_PRIO_0);
        }

        break;
      } /* PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS */ 
      
    case PROC_GAP_CENTRAL_SCAN_START_CODED_PHY:
    {
      phy = LE_CODED_PHY_BIT;
      
      status = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, 
                                              0x00, 
                                              LE_1M_PHY_BIT, 
                                              HCI_SCAN_TYPE_PASSIVE, 
                                              paramA, 
                                              paramB);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("(1M PHY) aci_gap_set_scan_configuration - fail, result: 0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> (1M PHY) aci_gap_set_scan_configuration - Success\n");
      }
      status = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, 
                                              0x00, 
                                              LE_CODED_PHY_BIT, 
                                              HCI_SCAN_TYPE_PASSIVE, 
                                              paramA, 
                                              paramB);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("(CODED PHY) aci_gap_set_scan_configuration - fail, result: 0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> (CODED PHY) aci_gap_set_scan_configuration - Success\n");
      }
      
      status = aci_gap_start_procedure (GAP_GENERAL_DISCOVERY_PROC,
                                        LE_CODED_PHY_BIT,
                                        0,
                                        0);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("(CODED PHY) aci_gap_start_procedure - fail, result: 0x%02X\n", status);
      }
      else
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        APP_DBG_MSG("==>> (CODED PHY) aci_gap_start_procedure - Success\n");
      }
      break;
    }/* PROC_GAP_CENTRAL_SCAN_START_CODED_PHY */
    
    /* USER CODE END GAP_CENTRAL_2 */
    default:
      break;
  }
  return;
}

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}
/* USER CODE BEGIN FD_LOCAL_FUNCTION */

static void Write_Char_Set_Task(void *arg)
{
  UTIL_SEQ_SetTask( 1U << CFG_TASK_WRITE_CHAR_ID, CFG_SEQ_PRIO_0);
 
  /* Start the timer to write to the Peripheral characteristic every 300ms. */
  HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Write_Char_timer_Id, WRITE_CHAR_TIMER_MS);
  return;
}


/**
* @brief Switch off the GPIO (LED).
*
* This function turns off the green LED.
*
* @param arg Pointer to the argument (not used in this function).
*/
static void Switch_On_Off_GPIO(void *arg)
{
  BSP_LED_Toggle(LD2);
  HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Scanning_Switch_On_Off_Led_timer_Id, SCAN_SWITCH_ON_OFF_LED2_TIMEOUT_MS);
  return;
}

/**
* @brief Analyse the advertising report to find a specific peripheral.
*
* This function parses the advertising data to identify a specific peripheral
* based on manufacturer-specific data. If the peripheral is found, its address
* and address type are stored in the application context.
*
* @param adv_data_size Size of the advertising data.
* @param p_adv_data Pointer to the advertising data.
* @param address_type Type of the address (public or random).
* @param p_address Pointer to the address of the advertising device.
* @return uint8_t Returns 1 if the specific peripheral is found, otherwise 0.
*/
static uint8_t Analyse_Adv_Report(uint8_t adv_data_size, uint8_t *p_adv_data,
                                  uint8_t address_type, uint8_t *p_address)
{
  uint8_t found_status = 0;
  uint16_t i = 0;
  uint8_t ad_length, ad_type;

  while(i < adv_data_size)
  {
    ad_length = p_adv_data[i];
    ad_type = p_adv_data[i + 1];
//    APP_DBG_MSG("p_address : 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
//                      p_address[5],
//                      p_address[4],
//                      p_address[3],
//                      p_address[2],
//                      p_address[1],
//                      p_address[0]);
    switch (ad_type)
    {
    case AD_TYPE_FLAGS:
      break;
    case AD_TYPE_TX_POWER_LEVEL:
      break;
    case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
      {
        if ((ad_length >= 7) && 
            (p_adv_data[i + 2] == ST_MANUF_ID_LSB)                  &&
              (p_adv_data[i + 3] == ST_MANUF_ID_MSB)                &&
                (p_adv_data[i + 4] == BLUESTSDK_V2)                 &&
                  (p_adv_data[i + 6] == FW_ID_RC_PERIPHERAL)        &&
                    (p_adv_data[i + 7] == FW_ID_RC_PERIPHERAL_D1)   &&
                      (p_adv_data[i + 8] == FW_ID_RC_PERIPHERAL_D2) &&
                        (p_adv_data[i + 9] == FW_ID_RC_PERIPHERAL_D3))
        {
          /* Peripheral BlueST v2 detected */
          bleAppContext.deviceServerBdAddrType = address_type;
          memcpy(bleAppContext.a_deviceServerBdAddr, p_address, BD_ADDR_SIZE);
          
