STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_RC_LongRange_Central/STM32_BLE/App/app_ble.c
          bleAppContext.deviceServerFound = 0x01;
          
          APP_DBG_MSG("  Peripheral, db addr 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
                      bleAppContext.a_deviceServerBdAddr[5],
                      bleAppContext.a_deviceServerBdAddr[4],
                      bleAppContext.a_deviceServerBdAddr[3],
                      bleAppContext.a_deviceServerBdAddr[2],
                      bleAppContext.a_deviceServerBdAddr[1],
                      bleAppContext.a_deviceServerBdAddr[0]);
          found_status = 1;
        }
        break;
      }
    default:
      break;
    }/* end of switch*/
    
    i += ad_length + 1; /* increment the iterator to go on next element*/
    
    if (found_status != 0)
    {
      break;
    }
  }/* end of while*/

  return found_status;
}

/**
 * @brief Initiates a connection request to a fixed public address.
 *
 * This function demonstrates how to perform a connection request to a device
 * with a fixed public address. It is intended for demo purposes and assumes
 * that the target device's address is known and fixed.
 *
 * @note Ensure that the target device with the fixed public address is
 *       available and in advertising mode before calling this function.
 *
 * @return None
 */
static void Connect_Request_Fixed_Addr(void)
{
  APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS);
  return;
}

/**
* @brief Initiate a connection request to a discovered BLE peripheral.
*
* This function attempts to create a connection to a discovered BLE peripheral device.
* It first sets the connection configuration and then attempts to create the connection.
* If the connection is successfully created, the connection handle is set.
*
* @note This function is specific to CFG_TASK_CONNECTION_REQUEST.
*/
static void Connect_Request(void)
{
  tBleStatus result;
  APP_DBG_MSG("Connect_Request() begin\n");
  
  if (bleAppContext.deviceServerFound != 0)
  {
    bleAppContext.deviceServerFound = 0;
    
    result = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                                  CONN_INT_MS(50u), 
                                                  CONN_INT_MS(100u),
                                                  0u,
                                                  CONN_SUP_TIMEOUT_MS(5000u),
                                                  CONN_CE_LENGTH_MS(10u),
                                                  CONN_CE_LENGTH_MS(10u));
    
    if (result == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_connection_configuration Success , result: 0x%02X\n", result);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_connection_configuration Failed , result: 0x%02X\n", result);
    }
    
    result = aci_gap_set_connection_configuration(LE_CODED_PHY_BIT,
                                                  CONN_INT_MS(50u), 
                                                  CONN_INT_MS(100u),
                                                  0u,
                                                  CONN_SUP_TIMEOUT_MS(5000u),
                                                  CONN_CE_LENGTH_MS(10u),
                                                  CONN_CE_LENGTH_MS(10u));
    
    if (result == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> (CODED PHY) aci_gap_set_connection_configuration Success , result: 0x%02X\n", result);
    }
    else
    {
      APP_DBG_MSG("==>> (CODED PHY) aci_gap_set_connection_configuration Failed , result: 0x%02X\n", result);
    }  
    
    if(phy == LE_1M_PHY_BIT)
    {
      APP_DBG_MSG("==>> (CODED PHY) phy = LE_1M_PHY_BIT\n");
    }
    else
    {
      APP_DBG_MSG("==>> (CODED PHY) phy = LE_CODED_PHY_BIT\n");
    }
    
    result = aci_gap_create_connection(phy,
                                       bleAppContext.deviceServerBdAddrType,
                                       &bleAppContext.a_deviceServerBdAddr[0]);    
    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
      APP_DBG_MSG("  wait for event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
      UTIL_SEQ_WaitEvt(1u << CFG_IDLEEVT_CONNECTION_COMPLETE);
      APP_DBG_MSG("  received event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
    }
    else
    {
      APP_DBG_MSG("==>> GAP Create connection Failed , result: 0x%02X\n", result);
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }
  }
  else
  {
    APP_DBG_MSG("--Connect_Request() Device Server Not Found\n");
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
  }
  
  if(bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    /* Stop the Scanning_Switch_On_Off_Led_timer_Id timer. No more needed. */
    HAL_RADIO_TIMER_StopVirtualTimer(&bleAppContext.Scanning_Switch_On_Off_Led_timer_Id);
    BSP_LED_Off(LD2);
  }
  
  APP_DBG_MSG("--Connect_Request() end \n");
  return;
}


/* This function is called when there is a L2CAP_CONN_UPDATE_RESP_Event vendor specific event. */ 
void aci_l2cap_connection_update_resp_event(uint16_t Connection_Handle,
                                            uint16_t Result)
{
  if(Result) {
    APP_DBG_MSG("> Connection parameters rejected.\n");
  } else  {
    APP_DBG_MSG("> Connection parameters accepted.\n");
  }
}

void hci_le_phy_update_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t TX_PHY,
                                      uint8_t RX_PHY)
{
  if(TX_PHY == HCI_TX_PHY_LE_CODED && RX_PHY == HCI_RX_PHY_LE_CODED)
  {
    /* Coded Phy Led3 On*/
    BSP_LED_On(LD3);
    APP_DBG_MSG("  PHY changed, tx:%d rx:%d Coded Phy Led3 On\n", TX_PHY, RX_PHY);
  }
  else 
  {
    if(TX_PHY == HCI_TX_PHY_LE_1M && RX_PHY == HCI_RX_PHY_LE_1M)
    {
      /* 1M Led3 Off */
      BSP_LED_Off(LD3);
      APP_DBG_MSG("  PHY changed, tx:%d rx:%d 1M Led3 Off\n", TX_PHY, RX_PHY);
    }
    else 
    {
      APP_DBG_MSG("  PHY changed Unexpected, tx:%d rx:%d 1M Led3 Off\n", TX_PHY, RX_PHY);
      for(int i=0; i<10; i++)
      {
        BSP_LED_Toggle(LD3);
        HAL_Delay(500);
      }
    }
  }
  
  HAL_RADIO_TIMER_StopVirtualTimer(&bleAppContext.Statistics_timer_Id);
  
