STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_RC_LongRange_Central/STM32_BLE/App/app_ble.c
  llc_conn_per_statistic(bleAppContext.BleApplicationContext_legacy.connectionHandle, &per_statistic_ptr);
  HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Statistics_timer_Id, STATS_INTERVAL_MS);  

}


void Stats_TimeoutCB(void *param)
{
  /* CRC error rate over the received packets */
  uint8_t CRC_errs_perc = (uint32_t)per_statistic_ptr.num_crc_err*100/per_statistic_ptr.num_pkts;
  /* Missed packet rate over the total number of RX events */
  uint8_t missed_pckt_perc = (uint32_t)per_statistic_ptr.num_miss_evts*100/(per_statistic_ptr.num_pkts+per_statistic_ptr.num_miss_evts);
  /* Packet error rate (packets missed or not received) over the total number of RX events */
  uint8_t packet_err_rate = (uint32_t)(per_statistic_ptr.num_crc_err+per_statistic_ptr.num_miss_evts)*100/(per_statistic_ptr.num_pkts+per_statistic_ptr.num_miss_evts);
  
  APP_DBG_MSG("\n");
  APP_DBG_MSG("\tCRC errs        %2d%%\n", CRC_errs_perc);
  APP_DBG_MSG("\tMissed packets  %2d%%\n", missed_pckt_perc);
  APP_DBG_MSG("\tPER             %2d%%\n", packet_err_rate);
  
  llc_conn_per_statistic(bleAppContext.BleApplicationContext_legacy.connectionHandle, &per_statistic_ptr);

  HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Statistics_timer_Id, STATS_INTERVAL_MS);
}


/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  APP_DBG_MSG("bleAppContext.Device_Connection_Status   0x%02X\n", bleAppContext.Device_Connection_Status);
  
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT )
  {
    APP_DBG_MSG("Device connected. Terminate the connection from the peripheral device.\n");
  }
  
  if(bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    phy = LE_1M_PHY_BIT;
    HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Scanning_Switch_On_Off_Led_timer_Id, SCAN_SWITCH_ON_OFF_LED2_TIMEOUT_MS);
    APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START);
  }
  return;
}

void APPE_Button2Action(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT)
  {
    APP_DBG_MSG("  APP_BLE_Procedure_Gap_General(PROC_GAP_GEN_PHY_TOGGLE_CODED);\n");
    APP_BLE_Procedure_Gap_General(PROC_GAP_GEN_PHY_TOGGLE_CODED);
  }
  return;
}

void APPE_Button3Action(void)
{
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT )
  {
    APP_DBG_MSG("Device connected. Terminate the connection from the peripheral device.\n");
    return;
  }
    
  if(bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    phy = LE_CODED_PHY_BIT;
    HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Scanning_Switch_On_Off_Led_timer_Id, SCAN_SWITCH_ON_OFF_LED2_TIMEOUT_MS);
    APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START_CODED_PHY);
  }
  return;
}

void APPE_Button1LongPressAction(void)
{
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT )
  {
    APP_DBG_MSG("Device connected. Terminate the connection from the peripheral device.\n");
    return;
  }
  
  if (bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
  {
     aci_gap_terminate_proc(GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC);
  }

  if(bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS_1M_PHY);
  }
  else
  {
    APP_DBG_MSG("  NO Action. bleAppContext.Device_Connection_Status   0x%02X\n", bleAppContext.Device_Connection_Status);
  }
  return;
}

void APPE_Button3LongPressAction(void)
{
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT )
  {
    APP_DBG_MSG("Device connected. Terminate the connection from the peripheral device.\n");
    return;
  }
      
  if (bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
  {
     aci_gap_terminate_proc(GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC);
  }

  if(bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_CONNECT_REQUEST_FIXED_ADDRESS_CODED_PHY);
  }
  else
  {
    APP_DBG_MSG("(CODED)  NO Action. bleAppContext.Device_Connection_Status   0x%02X\n", bleAppContext.Device_Connection_Status);
  }
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
